耳機=int(input('請問要買幾付耳機? '))
手機=int(input('請問要買幾支手機? '))
電腦=int(input('請問要買幾台電腦? '))
總金額=耳機*1950+電腦*23500+手機*18000
print('總金額為',總金額)

#%%
半徑=float(input('請輸入半徑? '))
直徑=半徑*2
圓周率=3.1415
橢圓形面積=圓周率*直徑*半徑
A=橢圓形面積
print('橢圓性面積', A)

#%%
身高=float(input('請輸入身高為幾公分? '))
體重=float(input('請輸入體重為幾公斤? '))
A = 身高/100
BMI = 體重 / (A**2) #次方這裡建議要上括號
print('BMI為  ',BMI)


#%%
本金=int(input('請輸入本金多少? '))
利率=float(input('請輸入利率是多少%? '))
y10 = 本金 * (( 1 + 利率/100 ) **10)
y11 = 本金 * (( 1 + 利率/100 ) **11)
y12 = 本金 * (( 1 + 利率/100 ) **12)
y13 = 本金 * (( 1 + 利率/100 ) **13)
y14 = 本金 * (( 1 + 利率/100 ) **14)
y15 = 本金 * (( 1 + 利率/100 ) **15)
本金與利息和=y10+y11+y12+y13+y14+y15
sum=本金與利息和
print('本金及利息和金額為',sum)

#%%
本金=int(input('請輸入本金多少? '))
利率=float(input('請輸入利率是多少%? '))
ii= 0.0

for ii in range (10,16,1):
    sum+= 本金 * (( 1 + 利率/100 ) ** ii)
print('本金及利息和金額為',sum)



